tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "gallopsled/pwntools-binutils", "git@github.com:Gallopsled/pwntools-binutils.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "purduesigbots/pros"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
tap "riscv/riscv"
brew "act"
brew "libpng"
brew "gettext"
brew "pcre"
brew "glib"
brew "autoconf"
brew "automake"
brew "binutils-aarch64"
brew "binutils-alpha"
brew "binutils-arm"
brew "binutils-avr"
brew "binutils-cris"
brew "binutils-hppa"
brew "binutils-i386"
brew "binutils-ia64"
brew "binutils-m68k"
brew "binutils-mips"
brew "binutils-mips64"
brew "binutils-msp430"
brew "binutils-powerpc"
brew "binutils-powerpc64"
brew "binutils-s390"
brew "binutils-sparc"
brew "binutils-vax"
brew "binutils-x86_64"
brew "binutils-xscale"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "pkg-config"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "ruby"
brew "cocoapods"
brew "gmp", link: false
brew "libtool"
brew "guile"
brew "nettle"
brew "unbound"
brew "libusb"
brew "lima"
brew "colima"
brew "coreutils"
brew "dfu-util"
brew "discount"
brew "docker"
brew "docker-compose"
brew "dos2unix"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "sdl2"
brew "srt"
brew "libarchive"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "git"
brew "git-crypt"
brew "glow"
brew "gnu-sed"
brew "libgcrypt"
brew "gnupg"
brew "gtk+"
brew "hashcat"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "kotlin"
brew "ktlint"
brew "kubernetes-cli"
brew "libimobiledevice"
brew "python@3.10"
brew "llvm"
brew "luv"
brew "mas"
brew "maven"
brew "ninja"
brew "meson"
brew "mosh"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nmap"
brew "openal-soft"
brew "openssl@3"
brew "perl"
brew "pinentry-mac"
brew "pv"
brew "python@3.8"
brew "ripgrep"
brew "rsync"
brew "scrcpy"
brew "shellcheck"
brew "speedread"
brew "speedtest-cli"
brew "telnet"
brew "thefuck"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wimlib"
brew "yadm"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp", link: false
brew "zlib"
brew "zsh"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "purduesigbots/pros/pros-cli"
brew "railwaycat/emacsmacport/emacs-mac"
cask "adoptopenjdk15"
cask "adoptopenjdk16"
cask "alfred"
cask "android-platform-tools"
cask "audacity"
cask "autodesk-fusion360"
cask "battle-net"
cask "bitwarden"
cask "blender"
cask "blobsaver"
cask "calibre"
cask "curseforge"
cask "discord-canary"
cask "dotnet-sdk"
cask "element"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "keybase"
cask "logitech-g-hub"
cask "minecraft"
cask "native-access"
cask "nvidia-geforce-now"
cask "obs"
cask "parallels"
cask "powder"
cask "qbittorrent"
cask "sidequest"
cask "steam"
cask "telegram"
cask "textual"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "zerotier-one"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Apple Configurator 2", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Brother iPrint&Scan", id: 1193539993
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "EOBD-Facile", id: 976630793
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
