tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "gallopsled/pwntools-binutils", "git@github.com:Gallopsled/pwntools-binutils.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "purduesigbots/pros"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
tap "riscv/riscv"
tap "sergiobenitez/osxct"
tap "tomoyanonymous/flatcam"
brew "act"
brew "libpng"
brew "apktool"
brew "arduino-cli"
brew "gettext"
brew "pcre"
brew "python@3.9"
brew "glib"
brew "atk"
brew "m4"
brew "autoconf"
brew "automake"
brew "berkeley-db", link: true
brew "binutils-aarch64"
brew "binutils-alpha"
brew "binutils-arm"
brew "binutils-avr"
brew "binutils-cris"
brew "binutils-hppa"
brew "binutils-i386"
brew "binutils-ia64"
brew "binutils-m68k"
brew "binutils-mips"
brew "binutils-mips64"
brew "binutils-msp430"
brew "binutils-powerpc"
brew "binutils-powerpc64"
brew "binutils-s390"
brew "binutils-sparc"
brew "binutils-vax"
brew "binutils-x86_64", link: false
brew "binutils-xscale"
brew "node"
brew "bitwarden-cli"
brew "bluetoothconnector"
brew "boost"
brew "pkg-config"
brew "gmp", link: false
brew "gcc"
brew "cava"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "ruby"
brew "cocoapods"
brew "libtool"
brew "guile"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "libslirp"
brew "libusb"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "dfu-util"
brew "discount"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "e2fsprogs"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "sdl2"
brew "srt"
brew "ffmpeg"
brew "fzf"
brew "geos"
brew "proj"
brew "poppler-qt5"
brew "gdal"
brew "gdk-pixbuf"
brew "pango"
brew "gtk+"
brew "gerbv"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-crypt"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "libgcrypt"
brew "gnupg"
brew "hashcat"
brew "htop"
brew "hyperfine"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "shared-mime-info"
brew "libraw"
brew "imagemagick"
brew "inetutils"
brew "jq"
brew "kotlin"
brew "ktlint"
brew "kubernetes-cli"
brew "llvm"
brew "luv"
brew "mas"
brew "maven"
brew "ninja"
brew "meson"
brew "mosh"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nmap"
brew "openal-soft"
brew "openssl@3"
brew "pcb2gcode"
brew "perl"
brew "php"
brew "pinentry-mac"
brew "projectm"
brew "pv"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "pyqt@5"
brew "python-tk@3.9"
brew "python@3.8"
brew "ripgrep"
brew "rsync"
brew "scrcpy"
brew "shellcheck"
brew "sl"
brew "spatialindex"
brew "speedread"
brew "speedtest-cli"
brew "spoof-mac"
brew "telnet", link: false
brew "thefuck"
brew "tio"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wimlib"
brew "yadm"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp", link: false
brew "zlib"
brew "zsh"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "purduesigbots/pros/pros-cli"
brew "railwaycat/emacsmacport/emacs-mac"
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
brew "tomoyanonymous/flatcam/flatcam-beta"
cask "adoptopenjdk15"
cask "adoptopenjdk16"
cask "alfred"
cask "android-ndk"
cask "android-platform-tools"
cask "arduino"
cask "audacity"
cask "autodesk-fusion360"
cask "battle-net"
cask "bitwarden"
cask "blender"
cask "blobsaver"
cask "calibre"
cask "curseforge"
cask "discord-canary"
cask "dotnet-sdk"
cask "element"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "keybase"
cask "kicad"
cask "logitech-g-hub"
cask "minecraft"
cask "native-access"
cask "nvidia-geforce-now"
cask "obs"
cask "parallels"
cask "powder"
cask "powershell"
cask "qbittorrent"
cask "sidequest"
cask "steam"
cask "superslicer"
cask "telegram"
cask "textual"
cask "tor-browser"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
cask "zerotier-one"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "NordVPN", id: 905953485
mas "The Unarchiver", id: 425424353
