tap "d12frosted/emacs-plus"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "messense/macos-cross-toolchains"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "playcover/playcover"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "sudar/arduino-mk"
brew "libpng"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "harfbuzz"
brew "apktool"
brew "arduino-cli"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bash-language-server"
brew "bitwarden-cli"
brew "black"
brew "butane"
brew "clang-format"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "dbus"
brew "dfu-util"
brew "docker"
brew "docker-compose"
brew "dos2unix"
brew "dotnet"
brew "enca"
brew "exiftool"
brew "fd"
brew "python@3.10"
brew "gobject-introspection"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-crypt"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "graphviz"
brew "helix"
brew "helm"
brew "htop"
brew "jansson"
brew "jdtls"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libgccjit"
brew "libplist"
brew "libpq"
brew "libxml2"
brew "libxpm"
brew "llvm"
brew "mailutils"
brew "mosh"
brew "ncdu"
brew "neovim"
brew "nginx", restart_service: true
brew "ninja"
brew "nmap"
brew "open-ocd"
brew "openal-soft"
brew "pinentry-mac"
brew "plantuml"
brew "pngpaste"
brew "poppler"
brew "pv"
brew "pyenv"
brew "ripgrep"
brew "rover"
brew "rsync"
brew "rust-analyzer"
brew "scrcpy"
brew "shfmt"
brew "sloccount"
brew "stlink"
brew "tccutil"
brew "tldr"
brew "tmux"
brew "unp"
brew "virtualenv"
brew "watch"
brew "websocat"
brew "wget"
brew "yadm"
brew "yt-dlp"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "qmk/qmk/qmk"
brew "sudar/arduino-mk/arduino-mk"
cask "alfred"
cask "anaconda"
cask "android-platform-tools"
cask "arduino"
cask "balenaetcher"
cask "blackhole-2ch"
cask "blobsaver"
cask "calibre"
cask "discord"
cask "firefox"
cask "git-credential-manager-core"
cask "google-chrome"
cask "graphql-playground"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "minecraft"
cask "native-access"
cask "nordvpn"
cask "obsidian"
cask "parallels"
cask "playcover-community"
cask "qbittorrent"
cask "rar"
cask "steam"
cask "superslicer"
cask "swimat"
cask "telegram"
cask "telegram-desktop"
cask "tor-browser"
cask "utm"
cask "visualvm"
cask "vlc"
